src/console/soap.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <u:Timestamp u:Id="_0">
                <u:Created>2021-11-19T18:49:31.314Z</u:Created>
                <u:Expires>2021-11-19T18:54:31.314Z</u:Expires>
            </u:Timestamp>
            <o:UsernameToken u:Id="uuid-4454cb9c-d5f7-4309-b2ef-99062277674c-4">
                <o:Username>patate</o:Username>
                <o:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">jolie</o:Password>
            </o:UsernameToken>
        </o:Security>
    </s:Header>
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <RCMR_IN000002UV01 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3">
           test
        </RCMR_IN000002UV01>
    </s:Body>
</s:Envelope>